Config/Catalogs/ОперандыПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОперандыПоказателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КонтрольныеСоотношения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияОперандов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапросаМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПромежуточныеИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОперандаРасчет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаИспользованияПолейЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаОперанда</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СопоставляемаяАналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/ОперандыПоказателейПравилаВычисленияПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОперандыПоказателейПравилаВычисленияПараметров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредставлениеПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисленияПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВычисленияПараметровОперандов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УточнениеСпособаОпределения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеДляПроверки</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАналитикиОтбор</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитАналитики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Операнд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперандыПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/УсловияКонтрольныхСоотношений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УсловияКонтрольныхСоотношений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособВычисленияПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВычисленияПараметровОперандов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УточнениеСпособаОпределения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАналитикиОтбор</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитАналитики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтрольноеСоотношение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрольныеСоотношения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СпособыПолученияОперандов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыПолученияОперандов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренниеДанныеПоказательОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутренниеДанныеПараметрическаяНастройка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособыВычисленияПараметровОперандов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВычисленияПараметровОперандов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПериодОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодОтчетаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеНачалаПериодаОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДатеКонцаПериодаОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаПериодаОтчетаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонцаПериодаОтчетаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаНачалаГодаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонцаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонцаГодаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АналогичныйПериодПредыдущегоГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АналогичныйПериодГодаСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФункцияНаВстроенномЯзыке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокФиксированныхЗначений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСпискеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеФиксированноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСписокФиксированныхЗначений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗначениеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСпискеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодСоСдвигом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодПредыдущий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследнийМесяцПериодаОтчетаСоСдвигом</Name>
					<Comment>По дате окончания определяется месяц, и сдвигается</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подобно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодобно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодобноСписку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодобноСписку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ГруппыРаскрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыРаскрытия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьСовпаденияИзмерений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ОперандыПоказателей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Перем СправочникОбъект;


#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСоответствиеВидовАналитики();
	
	Если Не Объект.Ссылка.Пустая()
		ИЛИ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ЗаполнитьФормуПоДаннымОбъекта();
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ОбновитьКодНаСервере();//если это копирование, заполним код
		КонецЕсли;
		
	Иначе
		Объект.СпособПолучения = Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеПоказательОтчета;
	КонецЕсли;
	
	Элементы.ТаблицаНастроекОтбораЗаполнитьТаблицуНастроекОтбора.Доступность = Не ТолькоПросмотр;
	Элементы.ТаблицаИспользуемойАналитикиЗаполнитьТаблицуИспользуемойАналитики.Доступность = Не ТолькоПросмотр;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) 
		И Не БюджетнаяОтчетность.СтрокаМожетИспользоватьсяВКачествеКода(Объект.Код) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Код должен начинаться с буквы и содержать только буквы, цифры и символы подчеркивания.'"),
														Объект.Ссылка,
														"Код",
														"Объект",
														Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПоказательОтбор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран показатель для отбора.'"),
														Объект.Ссылка,
														"ПоказательОтбор",
														"Объект",
														Отказ);
		
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьТаблицуДетализации(ТекущийОбъект);
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ПрошлыйКод = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка,"Код"));//сохраним прошлый код для замены в формуле КС
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьОтборыОперанда(ТекущийОбъект.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("ВладелецОперанда", Объект.Владелец);
	ПараметрОповещения.Вставить("ПоказательТекущегоОтчета",ПоказательТекущегоОтчета);
	ПараметрОповещения.Вставить("Операнд",Объект.Ссылка);
	ПараметрОповещения.Вставить("ПрошлыйКод",ПрошлыйКод);
	ПараметрОповещения.Вставить("НовыйКод",СокрЛП(Объект.Код));
	
	Оповестить("Справочник.ОперандыПоказателей.ЗаписьЭлемента", ПараметрОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказательОтборПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПоказательОтбор) Тогда
		ОбработатьИзменениеПоказателя();
	Иначе
		ТаблицаНастроекОтбора.Очистить();
		ТаблицаИспользуемойАналитики.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтрРезультат = "";
	Для Каждого СтрокаПараметр Из ТаблицаНастроекОтбора Цикл
		
		Если СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ЗначениеПоИерархии")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ВСпискеПоИерархии") 
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеФиксированноеЗначение")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеЗначениеПоИерархии")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеСписокФиксированныхЗначений")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии") Тогда
			 
			ЗначениеОтбора = ПредставлениеОтбора(СтрокаПараметр.УточнениеСпособаОпределения);
			СтрРезультат = СтрРезультат + " " + СокрП(СоответствиеВидовАналитики.Получить(СтрокаПараметр.ВидАналитикиОтбор))+": " + ЗначениеОтбора;  //СокрП(СтрокаПараметр.ВидАналитикиОтбор.Код)
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрРезультат) Тогда
		ЭталонноеНаименование = Элементы.Наименование.СписокВыбора[0].Значение;
		
		Если Элементы.Наименование.СписокВыбора.Количество()>1 Тогда
			Элементы.Наименование.СписокВыбора.Удалить(Элементы.Наименование.СписокВыбора[1]);
		КонецЕсли;
		
		Элементы.Наименование.СписокВыбора.Добавить(ЭталонноеНаименование + " " +СтрРезультат);	
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораДополненияНаименования",ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеОповещения,Элементы.Наименование.СписокВыбора,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДополненияНаименования(Результат,ДопПараметр) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Наименование = Результат.Значение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаНастроекОтбора

&НаКлиенте
Процедура ТаблицаНастроекОтбораСпособВычисленияПараметраОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекОтбораПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанныеСтроки.ОсновнойТип.СодержитТип(Тип("СправочникСсылка.Субконто")) Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанныеСтроки.СписокЗначенийАналитики) Тогда
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", ТекущиеДанныеСтроки.СписокЗначенийАналитики);
		Иначе
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", ТекущиеДанныеСтроки.ВидАналитикиОтбор);
		КонецЕсли;
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ПараметрВыбора);
		Элементы.ТаблицаНастроекОтбораУточнениеСпособаОпределения.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	КонецЕсли;
	
	// Установка ограничения возможных значений для способа получения операнда
	СписокВыбора = Элементы.ТаблицаНастроекОтбораСпособВычисленияПараметра.СписокВыбора;
	СписокВыбора.Очистить();
	
	ЕстьРеквизит = ЗначениеЗаполнено(ТекущиеДанныеСтроки.РеквизитАналитики) ИЛИ ЗначениеЗаполнено(ТекущиеДанныеСтроки.ВидКлассификатораБК);
	Для Каждого СтрСпособ Из ТекущиеДанныеСтроки.ВозможныеСпособыВычисления Цикл
		Если СтрСпособ.ДляРеквизита = ЕстьРеквизит Тогда
			СписокВыбора.Добавить(СтрСпособ.Способ);
		КонецЕсли;
	КонецЦикла;
	
	// Установка ограничения типа данных для строки отбора
	ОбработатьИзменениеСпособаВычисления(ТекущиеДанныеСтроки, Ложь);
	
	// Установка ограничения возможных значений для реквизита аналитики
	СписокВыбора = Элементы.ТаблицаНастроекОтбораРеквизитАналитики.СписокВыбора;
	СписокВыбора.Очистить();
	Для Каждого СтрСпособ Из ТекущиеДанныеСтроки.ВозможныеРеквизитыАналитики Цикл
		СписокВыбора.Добавить(СтрСпособ.Значение,СтрСпособ.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекОтбораСпособВычисленияПараметраПриИзменении(Элемент)
	ТекущиеДанныеСтроки = ТаблицаНастроекОтбора.НайтиПоИдентификатору(Элементы.ТаблицаНастроекОтбора.ТекущаяСтрока);
	ОбработатьИзменениеСпособаВычисления(ТекущиеДанныеСтроки,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСпособаВычисления(ТекущиеДанныеСтроки, ОчищатьРеквизитАналитики=Ложь)

	Перем ОписаниеТипов;
	
	Если ДоступностьРедактированияЗначенияОтбора(ТекущиеДанныеСтроки, ОписаниеТипов) Тогда
		
		Элементы.ТаблицаНастроекОтбораУточнениеСпособаОпределения.ОграничениеТипа = ОписаниеТипов;
		ТекущиеДанныеСтроки.ФлагДоступностьРедактирования = Истина;
		Элементы.ТаблицаНастроекОтбораУточнениеСпособаОпределения.РедактированиеТекста = Истина;
		
		// Для функции на встроенном языке следует отключить редактирование текста
		ЭтоФункцияНаВстроенномЯзыке = (ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ФункцияНаВстроенномЯзыке"));
		
		// Если выбран список значений, то необходимо добавить в него то значение,
		// которое было выбрано, как единичное.
		Если ЗначениеЗаполнено(ТекущиеДанныеСтроки.УточнениеСпособаОпределения)
			И (ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ВСпискеПоИерархии")
				Или ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии")
				Или ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений")
				Или ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеСписокФиксированныхЗначений"))
			И ТипЗнч(ТекущиеДанныеСтроки.УточнениеСпособаОпределения) <> Тип("СписокЗначений") Тогда
			 
			Если ЗначениеЗаполнено(ТекущиеДанныеСтроки.РеквизитАналитики) Тогда
				НовоеЗначение = Строка(ТекущиеДанныеСтроки.УточнениеСпособаОпределения);
			Иначе	 			 
				НовоеЗначение = ТекущиеДанныеСтроки.ОсновнойТип.ПривестиЗначение(ТекущиеДанныеСтроки.УточнениеСпособаОпределения);
			КонецЕсли;
			
			ТекущиеДанныеСтроки.УточнениеСпособаОпределения = Новый СписокЗначений;
			ТекущиеДанныеСтроки.УточнениеСпособаОпределения.Добавить(НовоеЗначение);
				
		ИначеЕсли ЭтоФункцияНаВстроенномЯзыке Тогда
			
			ТекущиеДанныеСтроки.УточнениеСпособаОпределения = Неопределено;
			Элементы.ТаблицаНастроекОтбораУточнениеСпособаОпределения.РедактированиеТекста = Ложь;
			
		Иначе
			
			ТекущиеДанныеСтроки.УточнениеСпособаОпределения = ОписаниеТипов.ПривестиЗначение(ТекущиеДанныеСтроки.УточнениеСпособаОпределения);
			
		КонецЕсли;
		
	Иначе
		
		ТекущиеДанныеСтроки.ФлагДоступностьРедактирования = Ложь;
		ТекущиеДанныеСтроки.УточнениеСпособаОпределения   = Неопределено;
		
		Если ОчищатьРеквизитАналитики Тогда
			ТекущиеДанныеСтроки.РеквизитАналитики   = "";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОбработатьИзменениеСпособаРасчета()

&НаКлиенте
Процедура ТаблицаНастроекОтбораУточнениеСпособаОпределенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанныеСтроки = Элементы.ТаблицаНастроекОтбора.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанныеСтроки.УточнениеСпособаОпределения) = Тип("СписокЗначений") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанныеСтроки.РеквизитАналитики) Тогда
			ТипЗначенияСписка = ТекущиеДанныеСтроки.ОсновнойТип;
		Иначе
			ТипЗначенияСписка = Новый ОписаниеТипов("Строка");
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТипЗначения", ТипЗначенияСписка);
		Если ЗначениеЗаполнено(ТекущиеДанныеСтроки.ВидКлассификатораБК) Тогда
			ПараметрыФормы.Вставить("ИмяФормыВыбораБК", БюджетнаяОтчетностьКлиентСервер.ПолучитьИмяФормыВыбораБК(ТекущиеДанныеСтроки.ВидКлассификатораБК));
		ИначеЕсли ТекущиеДанныеСтроки.ОсновнойТип.СодержитТип(Тип("ПланСчетовСсылка.ЕПСБУ"))
			И ЗначениеЗаполнено(ТекущиеДанныеСтроки.РеквизитАналитики) Тогда
			ПараметрыФормы.Вставить("ИмяФормыВыбораБК", "ПланСчетов.ЕПСБУ.ФормаВыбора");
		КонецЕсли;
		ПараметрыФормы.Вставить("Значение"   , ТекущиеДанныеСтроки.УточнениеСпособаОпределения);
		ПараметрыФормы.Вставить("ПараметрыВыбораЗначения", Элемент.ПараметрыВыбора);
		
		ОткрытьФорму("Справочник.ОперандыПоказателей.Форма.РедактированиеСпискаЗначенийОтбора", ПараметрыФормы, Элемент);
		
	ИначеЕсли ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ФункцияНаВстроенномЯзыке") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Значение", ТекущиеДанныеСтроки.ТекстМодуля);
		
		ОткрытьФорму("Справочник.ОперандыПоказателей.Форма.РедактированиеПроцедуры", ПараметрыФормы, Элемент);
		
	ИначеЕсли ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение")
			  ИЛИ ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеФиксированноеЗначение")
			  ИЛИ ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ЗначениеПоИерархии")
			  ИЛИ ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеЗначениеПоИерархии") Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанныеСтроки.ВидКлассификатораБК) Тогда
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму(БюджетнаяОтчетностьКлиентСервер.ПолучитьИмяФормыВыбораБК(ТекущиеДанныеСтроки.ВидКлассификатораБК), , Элемент);
		
	    ИначеЕсли ТекущиеДанныеСтроки.ОсновнойТип.СодержитТип(Тип("ПланСчетовСсылка.ЕПСБУ"))
			И ЗначениеЗаполнено(ТекущиеДанныеСтроки.РеквизитАналитики) Тогда
			
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", , Элемент);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекОтбораУточнениеСпособаОпределенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанныеСтроки = Элементы.ТаблицаНастроекОтбора.ТекущиеДанные;
	Если ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ФункцияНаВстроенномЯзыке") Тогда
		
		СтандартнаяОбработка            = Ложь;
		ТекущиеДанныеСтроки.ТекстМодуля = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекОтбораРеквизитАналитикиПриИзменении(Элемент)
	ТекущиеДанныеСтроки = Элементы.ТаблицаНастроекОтбора.ТекущиеДанные;
	
	// Установка ограничения возможных значений для способа получения операнда
	СписокВыбора = Элементы.ТаблицаНастроекОтбораСпособВычисленияПараметра.СписокВыбора;
	СписокВыбора.Очистить();
	
	ЕстьРеквизит = ЗначениеЗаполнено(ТекущиеДанныеСтроки.РеквизитАналитики);
	Для Каждого СтрСпособ Из ТекущиеДанныеСтроки.ВозможныеСпособыВычисления Цикл
		Если СтрСпособ.ДляРеквизита = ЕстьРеквизит Тогда
			СписокВыбора.Добавить(СтрСпособ.Способ);
		КонецЕсли;
	КонецЦикла;
	
	ОбработатьИзменениеСпособаВычисления(ТекущиеДанныеСтроки,НЕ ЗначениеЗаполнено(ТекущиеДанныеСтроки.РеквизитАналитики));	
	
	Если ТипЗнч(ТекущиеДанныеСтроки.УточнениеСпособаОпределения) = Тип("СписокЗначений") Тогда
		Если Не ЕстьРеквизит Тогда 
			ТекущиеДанныеСтроки.УточнениеСпособаОпределения = Новый СписокЗначений;
		Иначе
			НовыйСписок = Новый СписокЗначений;
			Для Каждого СтрСписка Из ТекущиеДанныеСтроки.УточнениеСпособаОпределения Цикл
				НовыйСписок.Добавить(Строка(СтрСписка.Значение));	
			КонецЦикла;
			ТекущиеДанныеСтроки.УточнениеСпособаОпределения = НовыйСписок;
		КонецЕсли;
	Иначе
		Если Не ЕстьРеквизит Тогда
			ТекущиеДанныеСтроки.УточнениеСпособаОпределения = ТекущиеДанныеСтроки.ОсновнойТип.ПривестиЗначение(Неопределено);
		Иначе
			ТекущиеДанныеСтроки.УточнениеСпособаОпределения = Строка(ТекущиеДанныеСтроки.УточнениеСпособаОпределения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаИспользуемойАналитики

&НаКлиенте
Процедура ТаблицаИспользуемойАналитикиРазворачиватьПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаИспользуемойАналитики.ТекущиеДанные;
	Если ТекДанные.РазворачиватьПоЗначению Тогда
		ТекДанные.РазворачиватьПоКоду = Ложь;
	КонецЕсли;
	
	ПроверитьНастройкиДетализацииДляДетализируемойАналитики();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИспользуемойАналитикиРазворачиватьПоКодуПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаИспользуемойАналитики.ТекущиеДанные;
	Если ТекДанные.РазворачиватьПоКоду Тогда
		ТекДанные.РазворачиватьПоЗначению = Ложь;
	КонецЕсли;
	
	ПроверитьНастройкиДетализацииДляДетализируемойАналитики();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИспользуемойАналитикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "ТаблицаИспользуемойАналитикиСопоставляемаяАналитика" Тогда	
		Возврат;		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТаблицаИспользуемойАналитики.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивАналитикДляВыбора = ПолучитьАналитикиДляВыбора(ТекДанные.ВидАналитики);
	
	СписокВыбора = Новый СписокЗначений;
		
	Для Каждого СтрМассива Из МассивАналитикДляВыбора Цикл
		СписокВыбора.Добавить(СтрМассива);
	КонецЦикла;
	
	Если СписокВыбора.Количество()
		ИЛИ ЗначениеЗаполнено(ТекДанные.СопоставляемаяАналитика) Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.АналитикаОтчетов.ПустаяСсылка"),"<Авто>");
	Иначе
		Возврат;
	КонецЕсли;
	
	ПослеВыбораЗначения = Новый ОписаниеОповещения("ПослеВыбораДетализируемойАналитики",ЭтотОбъект);
	ПоказатьВыборИзМеню(ПослеВыбораЗначения,СписокВыбора,Поле);
		
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТаблицуИспользуемойАналитикиКлиент(Команда)
	//Объект.ПравилаИспользованияПолейЗапроса.Очистить();
	ЗаполнитьТаблицуДетализации(Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуИспользуемойАналитики(Команда)
	
	ЗаполнитьТаблицуДетализации(Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНастроекОтбораКлиент(Команда)
	
	ЗаполнитьТаблицуОтбора(Истина,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуНастроекОтбора(Команда)
	
	ЗаполнитьТаблицуОтбора(Истина,Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФорма(Команда)
	
	Если ЗаписьСВопросом() Тогда 
		ЗадатьВопросОЗаписиИЗакрытии();
	Иначе 
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьФорма(Команда)
	
	Если ЗаписьСВопросом() Тогда 
		ЗадатьВопросОЗаписиИЗакрытии(Истина);
	Иначе 
		Если Записать() Тогда 
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСправочникОбъект()

	Если СправочникОбъект = Неопределено Тогда
		СправочникОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат СправочникОбъект;

КонецФункции // ПолучитьСправочникОбъект()

&НаСервере
Процедура ПоместитьСправочникОбъект()

	ЗначениеВРеквизитФормы(СправочникОбъект,"Объект");
	СправочникОбъект = Неопределено;

КонецПроцедуры // ПоместитьСправочникОбъект()


// Начальное заполнение для непустого объекта
//
&НаСервере
Процедура ЗаполнитьФормуПоДаннымОбъекта()

	// заполнить реквизит вид отчета
	ВидОтчета =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПоказательОтбор,"Владелец");
		
	// заполнить табличные части
	ЗаполнитьТаблицуОтбора(Ложь,Ложь,Истина);
	ЗаполнитьТаблицуДетализации(Ложь,Ложь);
	
	// заполнить список возможных наименований
	ЗаполнитьСписокВозможныхНаименований();
КонецПроцедуры // ЗаполнитьФорму()

// Создание вспомогательного списка наименований объекта
//
&НаСервере
Процедура ЗаполнитьСписокВозможныхНаименований()
	
	СписокВыбора = Элементы.Наименование.СписокВыбора;
	СписокВыбора.Очистить();
	
	ПростоеНаименование = Справочники.ОперандыПоказателей.ПолучитьНаименованиеБезОтбора(Объект.Наименование,Объект.ПоказательОтбор,3);
	СписокВыбора.Добавить(ПростоеНаименование);
	
	СтрРезультат = "";
	
	Для Каждого СтрокаПараметр Из ТаблицаНастроекОтбора Цикл		
		Если СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ЗначениеПоИерархии")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.ВСпискеПоИерархии") 
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеФиксированноеЗначение")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеЗначениеПоИерархии")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеСписокФиксированныхЗначений")
			 ИЛИ СтрокаПараметр.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии") Тогда
			 
			ЗначениеОтбора = ПредставлениеОтбора(СтрокаПараметр.УточнениеСпособаОпределения);
			СтрРезультат = СтрРезультат + " " + СокрП(СоответствиеВидовАналитики.Получить(СтрокаПараметр.ВидАналитикиОтбор))+": " + ЗначениеОтбора;  //СокрП(СтрокаПараметр.ВидАналитикиОтбор.Код)
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрРезультат) Тогда	
		НаименованиеОтбор	= ПростоеНаименование + " " + СтрРезультат;
		СписокВыбора.Добавить(НаименованиеОтбор);
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСписокВозможныхНаименований()

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеОтбора(ЗначениеОтбора)

	Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") и (ЗначениеОтбора.Количество() > 0 И ТипЗнч(ЗначениеОтбора[0].Значение) = Тип("Структура")) Тогда
		СтрРезультат = "";
		Для Каждого ЗначениеСписка Из ЗначениеОтбора Цикл
			СтрРезультат = СтрРезультат + "; " + ПредставлениеОтбора(ЗначениеСписка.Значение);
		КонецЦикла;
		Возврат Сред(СтрРезультат,3);
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("Структура") Тогда
		Возврат ЗначениеОтбора.Значение;
	Иначе
		Возврат Строка(ЗначениеОтбора);
	КонецЕсли;

КонецФункции // ПредставлениеОтбора()

// Заполнение таблицы отбора реквизитов
//
&НаСервере
Процедура ЗаполнитьТаблицуОтбора(Очищать = Ложь,СохранятьТекущиеНастройки,НачальноеЗаполнение=Ложь)
	Перем ТекущиеНастройки;
	
	Если СохранятьТекущиеНастройки = Истина Тогда
		ТекущиеНастройки = ТаблицаНастроекОтбора.Выгрузить();
	КонецЕсли;
	
	ТаблицаНастроекОтбора.Очистить();	
	ПолучитьСправочникОбъект();
	
	СправочникОбъект.ЗаполнитьНачальныеНастройки();
	
	//Если это открытие формы, то есть начальное заполнение отбора, то надо брать из регистра
	Если НачальноеЗаполнение = Истина Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОперандыПоказателейПравилаВычисленияПараметров.ИмяПараметра КАК ИмяПараметра,
			|	ОперандыПоказателейПравилаВычисленияПараметров.ПредставлениеПараметра,
			|	ОперандыПоказателейПравилаВычисленияПараметров.СпособВычисленияПараметра,
			|	ОперандыПоказателейПравилаВычисленияПараметров.УточнениеСпособаОпределения,
			|	ОперандыПоказателейПравилаВычисленияПараметров.ЗначениеДляПроверки,
			|	ОперандыПоказателейПравилаВычисленияПараметров.ТипРасчета,
			|	ОперандыПоказателейПравилаВычисленияПараметров.ВидАналитикиОтбор,
			|	ОперандыПоказателейПравилаВычисленияПараметров.ВидАналитикиОтбор.ВидКлассификатораБК КАК ВидКлассификатораБК,
			|	ВЫБОР
			|		КОГДА ОперандыПоказателейПравилаВычисленияПараметров.ИмяПараметра = ""Организация""
			|			ТОГДА 1
			|		КОГДА ОперандыПоказателейПравилаВычисленияПараметров.ИмяПараметра = ""ПериодОтчета""
			|			ТОГДА 2
			|		КОГДА ПОДСТРОКА(ОперандыПоказателейПравилаВычисленияПараметров.ИмяПараметра, 1, 9) = ""Реквизит_""
			|			ТОГДА 3
			|		ИНАЧЕ 4
			|	КОНЕЦ КАК ПорядокПолей,
			|	ОперандыПоказателейПравилаВычисленияПараметров.РеквизитАналитики
			|ИЗ
			|	РегистрСведений.ОперандыПоказателейПравилаВычисленияПараметров КАК ОперандыПоказателейПравилаВычисленияПараметров
			|ГДЕ
			|	ОперандыПоказателейПравилаВычисленияПараметров.Операнд = &Операнд
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядокПолей,
			|	ИмяПараметра";
		
		ОперандДляОтбора = Объект.Ссылка;
		Если Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ОперандДляОтбора = Параметры.ЗначениеКопирования;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Операнд", ОперандДляОтбора);
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаДляЗаполнения = РезультатЗапроса.Выгрузить();
	Иначе
		СправочникОбъект.ЗаполнитьПараметрыОперанда();
		ТаблицаДляЗаполнения = СправочникОбъект.мПравилаВычисленияПараметровЗапроса;
	КонецЕсли;
			
	ТипСтрока = Тип("Строка");
	
	Для Каждого СтрокаТЧОбъекта ИЗ ТаблицаДляЗаполнения Цикл
		
		СтрокаТЧФормы = ТаблицаНастроекОтбора.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧФормы,СтрокаТЧОбъекта,,"УточнениеСпособаОпределения");
		
		Если СтрокаТЧОбъекта.ВидАналитикиОтбор <> Неопределено
			И ТаблицаДляЗаполнения.Колонки.Найти("ВидКлассификатораБК") = Неопределено Тогда
			//при очистке операнда в мПравилаВычисленияПараметровЗапроса нет колонки ВидКлассификатораБК 
			СтрокаТЧФормы.ВидКлассификатораБК = СтрокаТЧОбъекта.ВидАналитикиОтбор.ВидКлассификатораБК;
		КонецЕсли;
		
		Если Очищать<>Истина Тогда
			Если СтрокаТЧОбъекта.УточнениеСпособаОпределения <> Неопределено Тогда
				НастройкаОтбора  = СтрокаТЧОбъекта.УточнениеСпособаОпределения.Получить();
				
				// Преобразование переносимого формата во внутренние данные ИБ
				УточнениеСпособа = БюджетнаяОтчетность.ПреобразоватьНастройкуОтбора(НастройкаОтбора);		
				
				Если СтрокаТЧФормы.СпособВычисленияПараметра =  Перечисления.СпособыВычисленияПараметровОперандов.ФункцияНаВстроенномЯзыке Тогда
					СтрокаТЧФормы.ТекстМодуля                 = УточнениеСпособа;
				Иначе
					СтрокаТЧФормы.УточнениеСпособаОпределения = УточнениеСпособа;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Вспомогательные данные редактирования
		ОписаниеАналитики = СправочникОбъект.мТаблицаВозможныхПолейОтбор.Найти(СтрокаТЧОбъекта.ИмяПараметра,"Поле");
		Если Не ОписаниеАналитики = Неопределено Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ОписаниеАналитики.ТипДанныхПоля);
			СтрокаТЧФормы.ОсновнойТип = Новый ОписаниеТипов(МассивТипов);
			
			МассивРеквизитов = БюджетнаяОтчетность.ПолучитьДопустимыеРеквизитыАналитикиПоТипу(ОписаниеАналитики.ТипДанныхПоля);
			Если МассивРеквизитов <> Неопределено Тогда
				СтрокаТЧФормы.ВозможныеРеквизитыАналитики.ЗагрузитьЗначения(МассивРеквизитов); 
			КонецЕсли;
		КонецЕсли;
		
		Если СохранятьТекущиеНастройки = Истина Тогда
			ТекСтрока = Неопределено;
			Если СтрокаТЧОбъекта.ИмяПараметра = "Организация"
				ИЛИ СтрокаТЧОбъекта.ИмяПараметра = "ПериодОтчета"
				ИЛИ СтрокаТЧОбъекта.ИмяПараметра = "Сценарий" Тогда
				ТекСтрока = ТекущиеНастройки.Найти(СтрокаТЧОбъекта.ИмяПараметра,"ИмяПараметра");
			ИначеЕсли Лев(СтрокаТЧОбъекта.ИмяПараметра,9) = "Реквизит_" Тогда
				НайденныеСтроки = ТекущиеНастройки.НайтиСтроки(Новый Структура("ИмяПараметра,ВидАналитикиОтбор",СтрокаТЧОбъекта.ИмяПараметра,СтрокаТЧОбъекта.ВидАналитикиОтбор));
				Если НайденныеСтроки.Количество()>0 Тогда
					ТекСтрока = НайденныеСтроки[0];
				КонецЕсли;
			ИначеЕсли Лев(СтрокаТЧОбъекта.ИмяПараметра,9) = "Аналитика" Тогда
				НайденныеСтроки = ТекущиеНастройки.НайтиСтроки(Новый Структура("ВидАналитикиОтбор",СтрокаТЧОбъекта.ВидАналитикиОтбор));
				Для Каждого СтрТЧ Из НайденныеСтроки Цикл
					Если Лев(СтрТЧ.ИмяПараметра,9) = "Аналитика" Тогда
						ТекСтрока = СтрТЧ;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//Заполним отбор как было
			Если ТекСтрока <> Неопределено Тогда				
				ЗаполнитьЗначенияСвойств(СтрокаТЧФормы,ТекСтрока,"СпособВычисленияПараметра,УточнениеСпособаОпределения,ТекстМодуля,РеквизитАналитики");
			КонецЕсли;
		КонецЕсли;	
		
		// Установка возможных значений, специфичных для типа данных
		СтрокиВозможныхСпособов = СправочникОбъект.мСоответствиеИзмеренийСпособовИТипов.НайтиСтроки(Новый Структура("ИмяИзмерения",СтрокаТЧОбъекта.ИмяПараметра));
		Для Каждого СтрСпособ Из СтрокиВозможныхСпособов Цикл
			
			Если ОписаниеАналитики = Неопределено Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(СтрСпособ.ТипДанных);
				СтрокаТЧФормы.ОсновнойТип = Новый ОписаниеТипов(МассивТипов);
				ОписаниеАналитики = Ложь;
			КонецЕсли;
			
			ТекТипДанных = ?(СтрСпособ.ТипДанных = Неопределено, СтрокаТЧФормы.ОсновнойТип, СтрСпособ.ТипДанных);
			Если СтрСпособ.СпособВычисления = Перечисления.СпособыВычисленияПараметровОперандов.ОрганизацияОтчета
				ИЛИ СтрСпособ.СпособВычисления = Перечисления.СпособыВычисленияПараметровОперандов.ПериодОтчета

				ИЛИ СтрСпособ.СпособВычисления = Перечисления.СпособыВычисленияПараметровОперандов.ДополнительныйРеквизит Тогда
				ТекТипДанных = Неопределено;
			КонецЕсли;
			
			ДобавитьСпособВыбора(СтрокаТЧФормы, СтрСпособ.СпособВычисления, ТекТипДанных, Ложь);
			// Для очистки 
			ДобавитьСпособВыбора(СтрокаТЧФормы, СтрСпособ.СпособВычисления, ТекТипДанных, Истина);
						
		КонецЦикла;
		
		// Установка возможных значений для всех типов
		
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение, СтрокаТЧФормы.ОсновнойТип.Типы(), Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеФиксированноеЗначение, СтрокаТЧФормы.ОсновнойТип.Типы(), Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ЗначениеПоИерархии, СтрокаТЧФормы.ОсновнойТип.Типы(), Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеЗначениеПоИерархии, СтрокаТЧФормы.ОсновнойТип.Типы(), Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений, Тип("СписокЗначений"), Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеСписокФиксированныхЗначений, Тип("СписокЗначений"), Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ВСпискеПоИерархии, Тип("СписокЗначений"), Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии, Тип("СписокЗначений"), Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ФункцияНаВстроенномЯзыке, ТипСтрока, Ложь);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеИспользуется, Неопределено, Ложь);
		
		//Способы отборов для реквизита аналитики
		
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение, ТипСтрока, Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеФиксированноеЗначение, ТипСтрока, Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ЗначениеПоИерархии, ТипСтрока, Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеЗначениеПоИерархии, ТипСтрока, Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений, Тип("СписокЗначений"), Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеСписокФиксированныхЗначений, Тип("СписокЗначений"), Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ВСпискеПоИерархии, Тип("СписокЗначений"),Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии, Тип("СписокЗначений"),Истина);
		//ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ФункцияНаВстроенномЯзыке, Тип("Строка"), Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.Подобно, ТипСтрока, Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеПодобно, ТипСтрока, Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.ПодобноСписку, Тип("СписокЗначений"), Истина);
		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеПодобноСписку, Тип("СписокЗначений"), Истина);

		ДобавитьСпособВыбора(СтрокаТЧФормы, Перечисления.СпособыВычисленияПараметровОперандов.НеИспользуется, Неопределено, Истина);
		
		СтрокаТЧФормы.ФлагДоступностьРедактирования = ДоступностьРедактированияЗначенияОтбора(СтрокаТЧФормы);
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТаблицуОтбора()

&НаСервере
Процедура ДобавитьСпособВыбора(Знач СтрокаТаблицы, Знач Способ, Знач ТипЗначения,Знач ДляРеквизита)

	Если ТипЗнч(ТипЗначения) = Тип("Массив") Тогда
		МассивТипов = ТипЗначения
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗначения);
	КонецЕсли;
	
	ОписаниеТиповСпособ = Новый ОписаниеТипов(МассивТипов);
	
	СтрНастроекСпособа             = СтрокаТаблицы.ВозможныеСпособыВычисления.Добавить();
	СтрНастроекСпособа.Способ      = Способ;
	СтрНастроекСпособа.ТипЗначения = ОписаниеТиповСпособ;
	СтрНастроекСпособа.ДляРеквизита = ДляРеквизита;

КонецПроцедуры // ДобавитьСпособВыбора()

&НаКлиентеНаСервереБезКонтекста
Функция ДоступностьРедактированияЗначенияОтбора(Знач ТекущиеДанныеСтроки, ОписаниеТипов = Неопределено)

	Результат = Ложь;
	
	ДляРеквизита = ЗначениеЗаполнено(ТекущиеДанныеСтроки.РеквизитАналитики) ИЛИ ЗначениеЗаполнено(ТекущиеДанныеСтроки.ВидКлассификатораБК);
	ОграниченияТипа = ТекущиеДанныеСтроки.ВозможныеСпособыВычисления.НайтиСтроки(Новый Структура("Способ,ДляРеквизита",ТекущиеДанныеСтроки.СпособВычисленияПараметра, ДляРеквизита));

	Если ОграниченияТипа.Количество() Тогда
		
		ОписаниеТипов = ОграниченияТипа[0].ТипЗначения;
		
		Если Не ОписаниеТипов = Неопределено и ОписаниеТипов.Типы().Количество() Тогда
			Результат = Истина;
		КонецЕсли;
	Иначе
		//Если выбран способ отбора, не допустимый для данной строки, то очистим его. 
		ТекущиеДанныеСтроки.СпособВычисленияПараметра = ПредопределенноеЗначение("Перечисление.СпособыВычисленияПараметровОперандов.НеИспользуется");
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ДоступностьРедактированияЗначенияОтбора()

// Заполнение таблицы раскрытия по аналитике
//
&НаСервере
Процедура ЗаполнитьТаблицуДетализации(Очищать, СохранятьТекущиеНастройки)
	Перем ТекущиеНастройки;
	
	Если Очищать = Истина Тогда
		Объект.ПравилаИспользованияПолейЗапроса.Очистить();
	КонецЕсли;
	
	Если СохранятьТекущиеНастройки = Истина Тогда
		ТекущиеНастройки = ТаблицаИспользуемойАналитики.Выгрузить();
	КонецЕсли;
	
	ТаблицаИспользуемойАналитики.Очистить();
	
	ПравилаИспользованияПолей = Объект.ПравилаИспользованияПолейЗапроса.Выгрузить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ПоказательОтбор) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрАналитики Из БюджетнаяОтчетностьСерверПовтИсп.КоллекцияАналитикГруппыРаскрытия(
		                              ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПоказательОтбор,"ГруппаРаскрытия")) Цикл
		
		СтрИспользуемых = ТаблицаИспользуемойАналитики.Добавить();
		СтрИспользуемых.ВидАналитики = СтрАналитики.ВидАналитики;
		СтрИспользуемых.КодАналитики = "Аналитика" + СтрАналитики.КодВидаАналитики;
		СтрИспользуемых.Поле 		 = СтрАналитики.ИмяОбъектаАналитики;		
		
		Если СохранятьТекущиеНастройки = Истина Тогда
			ТекСтрока = ТекущиеНастройки.Найти(СтрАналитики.ВидАналитики,"ВидАналитики");
			Если ТекСтрока <> Неопределено Тогда
				СтрИспользуемых.РазворачиватьПоКоду = ТекСтрока.РазворачиватьПоКоду;
				СтрИспользуемых.РазворачиватьПоЗначению = ТекСтрока.РазворачиватьПоЗначению;
				СтрИспользуемых.СопоставляемаяАналитика = ТекСтрока.СопоставляемаяАналитика;
			КонецЕсли;
		Иначе
			НайденнаяСтрока = ПравилаИспользованияПолей.Найти(СтрАналитики.ВидАналитики,"АналитикаОперанда");
			
			Если НайденнаяСтрока <> Неопределено Тогда
				Если ЗначениеЗаполнено(НайденнаяСтрока.РеквизитАналитики) Тогда
					СтрИспользуемых.РазворачиватьПоКоду = Истина;
				Иначе
					СтрИспользуемых.РазворачиватьПоЗначению = Истина;
				КонецЕсли;
				СтрИспользуемых.СопоставляемаяАналитика = НайденнаяСтрока.СопоставляемаяАналитика;
			КонецЕсли;
		КонецЕсли;
		
		СтрИспользуемых.СуществуетСопоставляемаяАналитика = ПолучитьАналитикиДляВыбора(СтрИспользуемых.ВидАналитики).Количество()>0;
		
		СтрИспользуемых.ВозможнаДетализацияПоКоду = БюджетнаяОтчетность.ПолучитьДопустимыеРеквизитыАналитикиПоТипу(СтрАналитики.ТипЗначения.Типы()[0]) <> Неопределено;		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТаблицуДетализации()

// Обработка формы по данным показателя
//
&НаСервере
Процедура ОбработатьИзменениеПоказателя()
	
	ПредыдущийВидОтчета = ВидОтчета;
	
	// заполнить реквизит вид отчета
	ВидОтчета =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПоказательОтбор,"Владелец");
	
	ПолучитьСправочникОбъект();
	
	// заполнить список возможных наименований
	ЗаполнитьСписокВозможныхНаименований();
	
	СправочникОбъект.Наименование = Элементы.Наименование.СписокВыбора[0].Значение;
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекКод = СокрЛП(ВидОтчета.Код) + "_" + СокрЛП(СправочникОбъект.ПоказательОтбор.Код);
		СправочникОбъект.УстановитьНовыйКод(СокрЛП(ВидОтчета.Код) + "_" + СокрЛП(СправочникОбъект.ПоказательОтбор.Код));
		Если СтрДлина(ТекКод) < СтрДлина(СправочникОбъект.Код) Тогда
			Если Число(Сред(СправочникОбъект.Код, СтрДлина(ТекКод) + 1)) = 1 Тогда
				СправочникОбъект.Код = ТекКод;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// заполнить табличные части
	СправочникОбъект.мПравилаВычисленияПараметровЗапроса.Очистить();
	СправочникОбъект.ПравилаИспользованияПолейЗапроса.Очистить();
		
	СправочникОбъект.ЗаполнитьНачальныеНастройки();
	СправочникОбъект.ЗаполнитьПараметрыОперанда();
	
	// Если другой вид отчета, очистим
	СохранятьОтборы = (ПредыдущийВидОтчета = ВидОтчета);
	
	ПоместитьСправочникОбъект();
	ЗаполнитьТаблицуОтбора(Ложь,СохранятьОтборы);
	ЗаполнитьТаблицуДетализации(Ложь,СохранятьОтборы);

КонецПроцедуры // ОбработатьИзменениеПоказателя()

// Запись таблицы формы ТаблицаИспользуемойАналитики в СправочникОбъект
//
&НаСервере
Процедура СохранитьТаблицуДетализации(ТекущийОбъект)

	ТекущийОбъект.ПравилаИспользованияПолейЗапроса.Очистить();
	
	Для Каждого СтрТЧ Из ТаблицаИспользуемойАналитики Цикл
		Если СтрТЧ.РазворачиватьПоЗначению
			ИЛИ СтрТЧ.РазворачиватьПоКоду Тогда
			СтрокаОбъекта = ТекущийОбъект.ПравилаИспользованияПолейЗапроса.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОбъекта, СтрТЧ);
			СтрокаОбъекта.АналитикаОперанда = СтрТЧ.ВидАналитики;
			
			Если СтрТЧ.РазворачиватьПоКоду Тогда
				СтрокаОбъекта.РеквизитАналитики = "<Авто>";	
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // СохранитьТаблицуДетализации()

&НаСервере
Процедура ОбновитьКодНаСервере()
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	ТекКод = БюджетнаяОтчетность.ВернутьАлфавитноЦифровоеПредставление(СокрЛП(ВидОтчета.Код) + "_" + СокрЛП(СправочникОбъект.ПоказательОтбор.Код));
	СправочникОбъект.СформироватьВозможныйКодОперанда(ТекКод);
	Объект.Код = СправочникОбъект.Код;
	СправочникОбъект = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоответствиеВидовАналитики()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АналитикаОтчетов.Ссылка,
		|	АналитикаОтчетов.Код
		|ИЗ
		|	ПланВидовХарактеристик.АналитикаОтчетов КАК АналитикаОтчетов
		|ГДЕ
		|	АналитикаОтчетов.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеА = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеА.Вставить(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Код);
	КонецЦикла;
	
	СоответствиеВидовАналитики = Новый ФиксированноеСоответствие(СоответствиеА);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтборыОперанда(Ссылка)
	
	Справочники.ОперандыПоказателей.ЗаписатьОтборыПравилВычисленяи(Ссылка,ТаблицаНастроекОтбора);
		
	ОпределитьПокатаельТекущегоОтчета();
	
КонецПроцедуры

&НаСервере
Функция ЗаписьСВопросом()
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ РегистрыСведений.УсловияКонтрольныхСоотношений.УстановленОтборКонтрольногоСоотношения(Объект.Владелец) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ОпределитьПокатаельТекущегоОтчета();
	
	Возврат НЕ ПоказательТекущегоОтчета;
	
КонецФункции

&НаСервере
Процедура ОпределитьПокатаельТекущегоОтчета()
	
	ПоказательТекущегоОтчета = Ложь;
	
	ЕстьОрганизация	 = Ложь;
	ЕстьПериодОтчета = Ложь;
	ВсеРеквизиты	 = Истина;
	
	Для Каждого СтрПараметр ИЗ ТаблицаНастроекОтбора Цикл
		
		Если СтрПараметр.ИмяПараметра="Организация" И СтрПараметр.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.ОрганизацияОтчета Тогда
			ЕстьОрганизация = Истина;
		ИначеЕсли СтрПараметр.ИмяПараметра="ПериодОтчета" И СтрПараметр.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.ПериодОтчета Тогда
			ЕстьПериодОтчета = Истина;
		ИначеЕсли Лев(СтрПараметр.ИмяПараметра,9)="Реквизит_" И СтрПараметр.СпособВычисленияПараметра<>Перечисления.СпособыВычисленияПараметровОперандов.ДополнительныйРеквизит Тогда
			ВсеРеквизиты = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ПоказательТекущегоОтчета = (ЕстьОрганизация И ЕстьПериодОтчета И ВсеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОЗаписиИЗакрытии(Закрыть=Ложь)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Закрыть",Закрыть);	
	
	ТекстВопроса = НСтр("ru = 'Установлены отборы в операнде!
								|В контрольном соотношении "+Строка(Объект.Владелец)+" будут удалены отборы по реквизитам. 
								|Продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗадатьВопросОЗаписиИЗакрытииЗавершение",ЭтотОбъект,ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОЗаписиИЗакрытииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьРеквизитыКонтрольногоСоотношения(Объект.Владелец);
		Если ДополнительныеПараметры.Закрыть Тогда
			Если Записать() Тогда
				Закрыть();	
			КонецЕсли;
		Иначе
			Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьРеквизитыКонтрольногоСоотношения(КонтрольноеСоотношение)
	РегистрыСведений.УсловияКонтрольныхСоотношений.ОчиститьРеквизитыКонтрольногоСоотношения(КонтрольноеСоотношение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДетализируемойАналитики(ВыбранныйЭлемент,ДопПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТаблицаИспользуемойАналитики.ТекущиеДанные;
	ТекДанные.СопоставляемаяАналитика = ВыбранныйЭлемент.Значение;
	
	ИдТекСтр = ТекДанные.ПолучитьИдентификатор();
	
	Для Каждого СтрТЧ Из ТаблицаИспользуемойАналитики Цикл
		Если ЗначениеЗаполнено(ТекДанные.СопоставляемаяАналитика) Тогда
			Если СтрТЧ.ВидАналитики = ТекДанные.СопоставляемаяАналитика
				И НЕ ЗначениеЗаполнено(СтрТЧ.СопоставляемаяАналитика) Тогда
				//если в таблице есть вид аналитики, который выбран детализируемым, то по нему нельзя разворачивать
				СтрТЧ.РазворачиватьПоЗначению = Ложь;
				СтрТЧ.РазворачиватьПоКоду = Ложь;
			ИначеЕсли СтрТЧ.ПолучитьИдентификатор() <> ИдТекСтр 
				И СтрТЧ.СопоставляемаяАналитика = ТекДанные.СопоставляемаяАналитика Тогда
				//если в таблице в другой строке есть такой же СопоставляемаяАналитика, то очистим его
				СтрТЧ.СопоставляемаяАналитика = Неопределено;
				СтрТЧ.РазворачиватьПоЗначению = Ложь;
				СтрТЧ.РазворачиватьПоКоду = Ложь;
			КонецЕсли;
		Иначе
			Если СтрТЧ.СопоставляемаяАналитика = ТекДанные.ВидАналитики Тогда
				//если в таблице есть вид аналитики, который выбран детализируемым, то по нему нельзя разворачивать
				СтрТЧ.РазворачиватьПоЗначению = Ложь;
				СтрТЧ.РазворачиватьПоКоду = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкиДетализацииДляДетализируемойАналитики()
	ТекДанные = Элементы.ТаблицаИспользуемойАналитики.ТекущиеДанные;
	
	ИдТекСтр = ТекДанные.ПолучитьИдентификатор();
	
	Если ТекДанные.РазворачиватьПоЗначению
		ИЛИ ТекДанные.РазворачиватьПоКоду Тогда
		
		Для Каждого СтрТЧ Из ТаблицаИспользуемойАналитики Цикл
			Если ЗначениеЗаполнено(ТекДанные.СопоставляемаяАналитика) Тогда
				Если СтрТЧ.ВидАналитики = ТекДанные.СопоставляемаяАналитика
					И НЕ ЗначениеЗаполнено(СтрТЧ.СопоставляемаяАналитика) Тогда
					//если в таблице есть вид аналитики, который выбран детализируемым, то по нему нельзя разворачивать
					СтрТЧ.РазворачиватьПоЗначению = Ложь;
					СтрТЧ.РазворачиватьПоКоду = Ложь;
				ИначеЕсли СтрТЧ.ПолучитьИдентификатор() <> ИдТекСтр 
					И СтрТЧ.СопоставляемаяАналитика = ТекДанные.СопоставляемаяАналитика Тогда
					//если в таблице в другой строке есть такой же СопоставляемаяАналитика, то очистим его
					СтрТЧ.СопоставляемаяАналитика = Неопределено;
					СтрТЧ.РазворачиватьПоЗначению = Ложь;
					СтрТЧ.РазворачиватьПоКоду = Ложь;
				КонецЕсли;
			Иначе
				Если СтрТЧ.СопоставляемаяАналитика = ТекДанные.ВидАналитики Тогда
					//если в таблице есть вид аналитики, который выбран детализируемым, то по нему нельзя разворачивать
					СтрТЧ.РазворачиватьПоЗначению = Ложь;
					СтрТЧ.РазворачиватьПоКоду = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
КонецПроцедуры


&НаСервере
Функция ПолучитьАналитикиДляВыбора(АналитикаОперанда)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыРаскрытияАналитика.ВидАналитики КАК ВидАналитики,
		|	ГруппыРаскрытияАналитика.ВидАналитики.ТипЗначения КАК ТипАналитики,
		|	ГруппыРаскрытияАналитика.ВидАналитики.Наименование КАК ВидАналитикиНаименование,
		|	ГруппыРаскрытияАналитика.ВидАналитики.СписокЗначений КАК ОбщийКлассификатор
		|ИЗ
		|	Справочник.ОперандыПоказателей КАК ОперандыПоказателей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
		|		ПО ОперандыПоказателей.ПоказательОтбор.ГруппаРаскрытия = ГруппыРаскрытияАналитика.Ссылка
		|ГДЕ
		|	ОперандыПоказателей.Владелец = &Владелец
		|	И ОперандыПоказателей.НеИспользуется = ЛОЖЬ
		|	И ГруппыРаскрытияАналитика.ВидАналитики.ВидКлассификатораБК = &ВидКлассификатораБК
		|	И ОперандыПоказателей.Ссылка <> &Ссылка
		|	И ГруппыРаскрытияАналитика.ВидАналитики <> &ВидАналитики
		|	И ГруппыРаскрытияАналитика.ВидАналитики.СписокЗначений = &ОбщийКлассификатор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидАналитикиНаименование";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидАналитики", АналитикаОперанда);
	Запрос.УстановитьПараметр("ВидКлассификатораБК", АналитикаОперанда.ВидКлассификатораБК);
	Запрос.УстановитьПараметр("ОбщийКлассификатор", АналитикаОперанда.СписокЗначений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипТекущейАналитики = АналитикаОперанда.ТипЗначения.Типы()[0];
	ЭтоТипСубконто = (ТипТекущейАналитики = Тип("СправочникСсылка.Субконто"));
	МассивВыбранныхАналитик = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МожноДобавлять = Ложь;
		Если Выборка.ТипАналитики.СодержитТип(ТипТекущейАналитики) Тогда
			Если ЭтоТипСубконто Тогда
				//Виды аналитики с типом субконто добавляем только те, у которых заполнен и совпадает общий классификатор
				Если ЗначениеЗаполнено(Выборка.ОбщийКлассификатор) Тогда
					МожноДобавлять = Истина;
				КонецЕсли;
			Иначе
				МожноДобавлять = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если МожноДобавлять 					
			И МассивВыбранныхАналитик.Найти(Выборка.ВидАналитики) = Неопределено Тогда
			МассивВыбранныхАналитик.Добавить(Выборка.ВидАналитики);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивВыбранныхАналитик;
	
КонецФункции



#КонецОбласти
